INSERT INTO staff_categories (name, enclosure_access) VALUES
  ('Ветеринар', 'Y'),
  ('Уборщик', 'Y'),
  ('Дрессировщик', 'Y'),
  ('Строитель-ремонтник', 'N'),
  ('Работник администрации', 'N');
  
INSERT INTO staff (
    last_name, first_name, middle_name, gender, birth_date, hire_date, salary, category_id, is_active, username, password_hash
) VALUES
  ('Иванов','Алексей', 'Петрович', 'М', '1980-03-15', '2010-06-01', 55000.00, 1, 1, 'aivanov', 'scrypt:32768:8:1$0oorYplSAcdZ2CUM$21c06d4bde4045103a964f18c2c9051161fcb82715c77994a49b83451e9fae292194c03745ab69eabdead1aa74cdbfcd245d4600818b84c8f444ef4436421c9e'),
  ('Сидорова', 'Мария', 'Ивановна', 'Ж', '1985-07-22', '2012-04-15', 45000.00, 2, 1, 'msidorova', 'scrypt:32768:8:1$4wcHuBXCKdEtxL7a$7a0b1f75a171e6f3da143b610752406d61298aa83703ef7c4ff9226dedc52a57ec2b7ed0dda39935cb5bdd873a964f118c537d75f04afbe61a09430561576359'),
  ('Петров', 'Николай', 'Сергеевич', 'М', '1978-11-05', '2008-09-10', 50000.00, 3, 1, 'npetrov', 'scrypt:32768:8:1$HYtMpCwZAwYrtsh4$905174121e77c0f339e3f2df367123bddec18ddd65e9846c052fc24b66342a8408a70a580e7484197a51bcecf57db59954430d1728dc3d9b5bf51254cc2eacea'),
  ('Кузнецова', 'Елена', 'Александровна', 'Ж', '1990-01-30', '2015-03-20', 60000.00, 4, 1, 'ekuznetsova', 'scrypt:32768:8:1$RkWaQ2LJaCdVZmpw$8bf58183b21605c38b0874db5195b0afb9dc0019c1fd59dfaae51cfb14f92403a9d3132dadcf8f6b8e5f845839f7780777283e6bfdf62a92d07a742a5f34bb5c'),
  ('Морозов', 'Сергей', 'Васильевич', 'М', '1982-05-12', '2009-08-25', 70000.00, 5, 1, 'smorozov', 'scrypt:32768:8:1$QJJ2cbnjyhdszdeq$8a35d27f545e059ae890ca2851c3a6fff3d07057fc78a8862a213f679346d59471e2c573712672588ee6f7081a6a6d056b77a02c3826e46461eeb0db99bce219'),
  ('Соколов', 'Дмитрий', 'Андреевич', 'М', '1992-09-14', '2020-02-18', 58000.00, 1, 1, 'dsokolov', 'scrypt:32768:8:1$r990J3yVKn8EEffF$c179a2e7ffc93890e500893e1f8b916aa2d634258202dbcf176925e5e792fe10aff95cacdf1a0ffd6ad6894d0a9f6658c0acce4ab194150c756b2ec43be07ba1'),
  ('Козлова', 'Ольга', 'Викторовна', 'Ж', '1995-04-22', '2021-05-12', 42000.00, 2, 1, 'okozlova', 'scrypt:32768:8:1$Bf2x3WMZNwmq45OZ$88390cd6d85ed665ffeabc18c876a0385cbf550d1aa548969d7071ab8b0fec75ccae8e5380dc8a1631f86163a7b87aca58f266d07cbc338a4426eff6dc58ef23'),
  ('Орлов', 'Игорь', 'Николаевич', 'М', '1990-12-03', '2019-11-09', 52000.00, 3, 1, 'iorlov', 'scrypt:32768:8:1$QXzR5qcRi6q9balh$baefd80a8213ffda5fb463cf86a3dd7b714f018b029a5058070ded7ec03db079022e9b5cc1af15a01ecde998dba502e02cf546ad491556bfecf558956d0e69f7'),
  ('Тихонов', 'Александр', 'Сергеевич', 'М', '1987-06-28', '2022-03-01', 62000.00, 4, 1, 'atikhonov', 'scrypt:32768:8:1$m0i4D2PadAIO30gp$860635b94cde767e7c1185adfefb39d4a3977e52e5ddb593c58edd389d08235a415d8d4450650434dc6f0e42159fda7655b15cef021845ecae8aa9405ade5dc4'),
  ('Захарова', 'Екатерина', 'Дмитриевна', 'Ж', '1989-10-11', '2017-07-14', 72000.00, 5, 1, 'ezaharova', 'scrypt:32768:8:1$Qn5OZKKeQOO1kXcm$be6c978872adc067c09507f47defd09dab2a3bea7a815fb5167b6b8c99e91526349d46579d1bd7793972b1fc4687e2beba2ad78dbd76f9f54488426dbbf04c90');

INSERT INTO category_attributes (category_id, attribute_name) VALUES
  (1, 'Специализация'),
  (1, 'Опыт работы (лет)'),
  (2, 'Смена'),
  (2, 'Уровень ответственности'),
  (3, 'Тип животных'),
  (3, 'Метод дрессировки'),
  (4, 'Профессия'),
  (4, 'Сертификаты'),
  (5, 'Должность'),
  (5, 'Отдел');

INSERT INTO staff_attribute_values (staff_id, attribute_id, attribute_value) VALUES
  (1, 1, 'Хирургия, терапия'), 
  (1, 2, '12'),
  (2, 3, 'Ночная'), 
  (2, 4, 'Высокий'),
  (3, 5, 'Приматы'), 
  (3, 6, 'Позитивное подкрепление'),
  (4, 7, 'Электрик'), 
  (4, 8, 'Свидетельство №123'),
  (5, 9, 'Директор'), 
  (5, 10, 'Администрация'),
  (6, 1, 'Общая практика'), 
  (6, 2, '4'),
  (7, 3, 'Дневная'), 
  (7, 4, 'Средний'),
  (8, 5, 'Хищные птицы'), 
  (8, 6, 'Кликер-тренинг'),
  (9, 7, 'Сантехник'), 
  (9, 8, 'Свидетельство №456'),
  (10, 9, 'Заместитель директора'), 
  (10, 10, 'Логистика');

INSERT INTO climate_zones (name) VALUES
  ('Тропический'),
  ('Субтропический'),
  ('Умеренный'),
  ('Континентальный'),
  ('Арктический'),
  ('Средиземноморский');

INSERT INTO feeding_classifications (name) VALUES
  ('Хищник'),
  ('Травоядное');

INSERT INTO species (type_name, classification, climate_zone, need_warm, puberty_age) VALUES
  ('Тигр', 1, 2, 'Y', 3),
  ('Зебра', 2, 3, 'Y', 2),
  ('Обезьяна', 2, 1, 'Y', 4),
  ('Волк', 1, 4, 'N', 2),
  ('Лев', 1, 3, 'Y', 3),
  ('Панда', 2, 3, 'Y', 5),
  ('Кенгуру', 2, 2, 'Y', 2),
  ('Пингвин', 2, 5, 'N', 3);

INSERT INTO enclosures (name, is_warm, length, width, height, notes) VALUES
  ('Вольер 1', 'Y', 30.00, 20.00, 8.00, 'Для тигров, требуется отопление'),
  ('Вольер 2', 'Y', 35.00, 25.00, 9.00, 'Для львов, требуется отопление'),
  ('Клетка 1', 'N', 20.00, 15.00, 6.00, 'Для волков, без отопления'),
  ('Вольер 3', 'Y', 40.00, 30.00, 10.00, 'Для зебр'),
  ('Клетка 2', 'Y', 15.00, 12.00, 5.00, 'Для обезьян'),
  ('Вольер 4', 'Y', 25.00, 20.00, 8.00, 'Для панд'),
  ('Вольер 5', 'Y', 30.00, 25.00, 8.00, 'Для кенгуру'),
  ('Клетка 3', 'N', 20.00, 18.00, 6.00, 'Для пингвинов, без отопления'),
  ('Вольер 6', 'Y', 30.00, 20.00, 8.00, 'Резерв для тигров'),
  ('Клетка 4', 'N', 20.00, 15.00, 6.00, 'Резерв для волков');

INSERT INTO enclosure_neighbors (enclosure1_id, enclosure2_id) VALUES
  (1, 9),
  (3, 10),
  (4, 5),
  (6, 7);

INSERT INTO animals (species_id, name, gender, birth_date, arrival_date, enclosure_id, parent1_id, parent2_id) VALUES
  (1, 'Тигр Рой', 'М', '2014-04-10', '2015-05-01', 1, NULL, NULL),
  (1, 'Тигрица Лана', 'Ж', '2013-03-12', '2014-04-20', 1, NULL, NULL),
  (1, 'Тигрёнок Симба', 'М', '2023-05-15', '2023-06-01', 1, 1, 2),
  (2, 'Зебра Зара', 'Ж', '2016-07-22', '2017-08-10', 4, NULL, NULL),
  (2, 'Зебра Барни', 'М', '2015-06-18', '2016-07-05', 4, NULL, NULL),
  (2, 'Зебрёнок Макс', 'М', '2020-04-10', '2020-04-15', 4, 4, 5),
  (3, 'Мартышка Лида', 'Ж', '2017-08-01', '2018-08-25', 5, NULL, NULL),
  (3, 'Мартышка Адам', 'М', '2016-10-10', '2017-11-05', 5, NULL, NULL),
  (3, 'Мартышка Игорь', 'М', '2021-02-11', '2021-02-20', 5, 7, 8),
  (4, 'Волчица Альфа', 'Ж', '2014-11-20', '2015-12-01', 3, NULL, NULL),
  (4, 'Волк Брут', 'М', '2013-10-18', '2014-11-10', 3, NULL, NULL),
  (4, 'Волчонок Гром', 'М', '2019-01-03', '2019-01-15', 3, 10, 11),
  (5, 'Львица Кира', 'Ж', '2015-06-25', '2016-07-10', 2, NULL, NULL),
  (5, 'Лев Рамзес', 'М', '2014-05-14', '2015-06-20', 2, NULL, NULL),
  (5, 'Львёнок Лео', 'М', '2020-09-10', '2020-09-20', 2, 13, 14),
  (6, 'Панда Лили', 'Ж', '2016-01-17', '2017-02-25', 6, NULL, NULL),
  (6, 'Панда Влад', 'М', '2015-02-20', '2016-03-10', 6, NULL, NULL),
  (6, 'Панда Снежок', 'М', '2022-03-01', '2022-03-15', 6, 16, 17),
  (7, 'Кенгуру Кенни', 'М', '2018-09-14', '2019-10-01', 7, NULL, NULL),
  (7, 'Кенгуру Мими', 'Ж', '2019-01-05', '2020-02-01', 7, NULL, NULL),
  (7, 'Кенгурёнок Джек', 'М', '2023-06-18', '2023-06-25', 7, 19, 20),
  (2, 'Зебрёнок Ольга', 'Ж', '2023-08-10', '2023-08-15', 4, 4, 5),
  (8, 'Пингвин Квайла', 'М', '2018-02-02', '2018-03-01', 8, NULL, NULL),
  (8, 'Пингвин Лола',   'Ж', '2019-05-05', '2019-06-01', 8, NULL, NULL);

INSERT INTO incompatible_species (species1_id, species2_id) VALUES
  (1, 2),
  (1, 3),
  (1, 6),
  (1, 7),
  (1, 8),
  (4, 2),
  (4, 3),
  (4, 6),
  (4, 7),
  (4, 8),
  (5, 2),
  (5, 3),
  (5, 6),
  (5, 7),
  (5, 8);

INSERT INTO animal_movement_history (animal_id, from_enclosure, to_enclosure, move_date) VALUES
  (1, 1, 9, '2018-07-10'),
  (6, 3, 10, '2019-05-05'),
  (15, 7, 9, '2023-09-10'),
  (16, 8, 10, '2023-10-01');

INSERT INTO animal_caretakers (animal_id, staff_id, start_date, end_date) VALUES
  (1, 1, '2016-06-15', NULL),
  (4, 1, '2013-10-01', NULL),
  (1, 3, '2018-02-20', NULL),
  (8, 2, '2015-04-10', '2019-12-31'),
  (10, 3, '2018-02-20', NULL),
  (5, 6, '2020-03-01', NULL),
  (12, 7, '2021-06-01', '2023-12-31'),
  (14, 8, '2022-04-01', NULL);

INSERT INTO diseases (name) VALUES
  ('Паразитарная инфекция'),
  ('Респираторная инфекция');

INSERT INTO vaccines (disease_id, name) VALUES
  (1, 'Антипаразитарная вакцина'),
  (2, 'Противореспираторная вакцина');

INSERT INTO animal_diseases (animal_id, veterinarian_id, disease_id, diagnosed_date, recovery_date, notes) VALUES
  (1, 1, 1, '2017-06-15', '2017-07-01', 'Легкое течение'),
  (4, 1, 1, '2016-09-10', '2016-09-25', 'Умеренное течение'),
  (4, 1, 2, '2018-01-15', '2018-01-30', 'Назначено противореспираторное лечение');

INSERT INTO animal_vaccinations (animal_id, vaccine_id, vaccination_date, next_vaccination_date) VALUES
  (1, 1, '2017-06-15', '2018-06-15'),
  (4, 1, '2016-09-10', '2017-09-10'),
  (4, 2, '2018-02-01', '2019-02-01');

INSERT INTO animal_medical_records (animal_id, record_date, weight, height, notes) VALUES
  (1, '2018-06-15', 220.50, 1.20, 'Регулярный осмотр'),
  (4, '2017-04-10', 190.00, 1.10, 'Стабильное состояние'),
  (2, '2023-05-20', 180.00, 1.15, 'Плановый осмотр'),
  (5, '2023-06-10', 170.50, 1.05, 'Профилактический осмотр');

INSERT INTO feed_types (name) VALUES
  ('Растительный'),
  ('Живой'),
  ('Мясо'),
  ('Комбикорм');

INSERT INTO feed_items (feed_type, name) VALUES
  (1, 'Фрукты'),
  (1, 'Овощи'),
  (2, 'Мыши'),
  (2, 'Птицы'),
  (2, 'Корм для рыб'),
  (2, 'Рыба'),
  (3, 'Говядина'),
  (4, 'Смешанный корм');

INSERT INTO feed_suppliers (name, phone, address) VALUES
  ('Поставщик №1', '+7-123-456-7890', 'г. Москва, ул. Ленина, д.1'),
  ('Поставщик №2', '+7-987-654-3210', 'г. Санкт-Петербург, пр-т. Мира, д.10');

INSERT INTO supplier_feed_types (supplier_id, feed_type_id) VALUES
  (1, 1),
  (1, 3),
  (2, 2),
  (2, 4);

INSERT INTO feed_inventory (feed_item_id, quantity, received_date) VALUES
  (1, 150.00, '2024-01-10 09:00:00'),
  (6, 80.00, '2024-01-12 10:30:00'),
  (4, 50.00, '2024-01-15 11:00:00'),
  (5, 60.00, '2024-01-18 12:00:00');

INSERT INTO feed_production (feed_item_id, production_date, quantity) VALUES
  (2, '2024-02-01', 30.00),
  (8, '2024-02-05', 50.00),
  (3, '2024-02-07', 5.00);

INSERT INTO animal_diet_requirements (species_id, age_group, body_condition, season, feed_type_id, required_quantity, feeding_times_per_day
) VALUES
-- Тигр (мясо)
(1, 'Молодой', 'Хорошее', 'Зима', 3, 6.0, 3),
(1, 'Молодой', 'Хорошее', 'Лето', 3, 5.5, 3),
(1, 'Молодой', 'Плохое', 'Зима', 3, 5.0, 2),
(1, 'Молодой', 'Плохое', 'Лето', 3, 4.5, 2),
(1, 'Молодой', 'Хорошее', 'Весна', 3, 5.0, 3),
(1, 'Молодой', 'Хорошее', 'Осень', 3, 4.5, 3),
(1, 'Молодой', 'Плохое', 'Весна', 3, 4.0, 2),
(1, 'Молодой', 'Плохое', 'Осень', 3, 3.5, 2),
(1, 'Взрослый', 'Хорошее', 'Зима', 3, 10.0, 3),
(1, 'Взрослый', 'Хорошее', 'Лето', 3, 9.0, 3),
(1, 'Взрослый', 'Плохое', 'Зима', 3, 8.0, 2),
(1, 'Взрослый', 'Плохое', 'Лето', 3, 7.0, 2),
(1, 'Взрослый', 'Хорошее', 'Весна', 3, 9.0, 3),
(1, 'Взрослый', 'Хорошее', 'Осень', 3, 8.0, 3),
(1, 'Взрослый', 'Плохое', 'Весна', 3, 7.0, 2),
(1, 'Взрослый', 'Плохое', 'Осень', 3, 6.0, 2),

-- Зебра (растительный)
(2, 'Молодой', 'Хорошее', 'Зима', 1, 4.0, 3),
(2, 'Молодой', 'Хорошее', 'Лето', 1, 5.0, 4),
(2, 'Молодой', 'Плохое', 'Зима', 1, 3.0, 3),
(2, 'Молодой', 'Плохое', 'Лето', 1, 4.0, 4),
(2, 'Молодой', 'Хорошее', 'Весна', 1, 3.0, 3),
(2, 'Молодой', 'Хорошее', 'Осень', 1, 4.0, 4),
(2, 'Молодой', 'Плохое', 'Весна', 1, 2.0, 3),
(2, 'Молодой', 'Плохое', 'Осень', 1, 3.0, 4),
(2, 'Взрослый', 'Хорошее', 'Зима', 1, 6.0, 3),
(2, 'Взрослый', 'Хорошее', 'Лето', 1, 7.0, 4),
(2, 'Взрослый', 'Плохое', 'Зима', 1, 5.0, 3),
(2, 'Взрослый', 'Плохое', 'Лето', 1, 6.0, 4),
(2, 'Взрослый', 'Хорошее', 'Весна', 1, 5.0, 3),
(2, 'Взрослый', 'Хорошее', 'Осень', 1, 6.0, 4),
(2, 'Взрослый', 'Плохое', 'Весна', 1, 4.0, 3),
(2, 'Взрослый', 'Плохое', 'Осень', 1, 5.0, 4),

-- Обезьяна (растительный)
(3, 'Молодой', 'Хорошее', 'Годовой', 1, 3.0, 3),
(3, 'Молодой', 'Плохое', 'Годовой', 1, 2.0, 2),
(3, 'Взрослый', 'Хорошее', 'Годовой', 1, 4.0, 3),
(3, 'Взрослый', 'Плохое', 'Годовой', 1, 3.0, 2),

-- Волк (мясо)
(4, 'Молодой', 'Хорошее', 'Зима', 3, 5.0, 3),
(4, 'Молодой', 'Хорошее', 'Лето', 3, 4.0, 3),
(4, 'Молодой', 'Плохое', 'Зима', 3, 3.5, 2),
(4, 'Молодой', 'Плохое', 'Лето', 3, 3.0, 2),
(4, 'Молодой', 'Хорошее', 'Весна', 3, 4.0, 3),
(4, 'Молодой', 'Хорошее', 'Осень', 3, 3.0, 3),
(4, 'Молодой', 'Плохое', 'Весна', 3, 2.5, 2),
(4, 'Молодой', 'Плохое', 'Осень', 3, 2.0, 2),
(4, 'Взрослый', 'Хорошее', 'Зима', 3, 8.0, 3),
(4, 'Взрослый', 'Хорошее', 'Лето', 3, 7.0, 3),
(4, 'Взрослый', 'Плохое', 'Зима', 3, 6.0, 2),
(4, 'Взрослый', 'Плохое', 'Лето', 3, 5.5, 2),
(4, 'Взрослый', 'Хорошее', 'Весна', 3, 7.0, 3),
(4, 'Взрослый', 'Хорошее', 'Осень', 3, 6.0, 3),
(4, 'Взрослый', 'Плохое', 'Весна', 3, 5.0, 2),
(4, 'Взрослый', 'Плохое', 'Осень', 3, 4.5, 2),

-- Лев (мясо)
(5, 'Молодой', 'Хорошее', 'Годовой', 3, 5.0, 3),
(5, 'Молодой', 'Плохое', 'Годовой', 3, 4.0, 2),
(5, 'Взрослый', 'Хорошее', 'Годовой', 3, 9.0, 3),
(5, 'Взрослый', 'Плохое', 'Годовой', 3, 7.0, 2),

-- Панда (растительный)
(6, 'Молодой', 'Хорошее', 'Зима', 4, 5.0, 3),
(6, 'Молодой', 'Хорошее', 'Лето', 1, 4.0, 3),
(6, 'Молодой', 'Плохое', 'Зима', 4, 3.5, 2),
(6, 'Молодой', 'Плохое', 'Лето', 1, 3.0, 2),
(6, 'Молодой', 'Хорошее', 'Весна', 1, 4.0, 3),
(6, 'Молодой', 'Хорошее', 'Осень', 4, 3.0, 3),
(6, 'Молодой', 'Плохое', 'Весна', 1, 2.5, 2),
(6, 'Молодой', 'Плохое', 'Осень', 4, 2.0, 2),
(6, 'Взрослый', 'Хорошее', 'Зима', 4, 8.0, 3),
(6, 'Взрослый', 'Хорошее', 'Лето', 1, 7.0, 3),
(6, 'Взрослый', 'Плохое', 'Зима', 4, 6.0, 2),
(6, 'Взрослый', 'Плохое', 'Лето', 1, 5.5, 2),
(6, 'Взрослый', 'Хорошее', 'Весна', 1, 7.0, 3),
(6, 'Взрослый', 'Хорошее', 'Осень', 4, 6.0, 3),
(6, 'Взрослый', 'Плохое', 'Весна', 1, 5.0, 2),
(6, 'Взрослый', 'Плохое', 'Осень', 4, 4.5, 2),

-- Кенгуру (растительный)
(7, 'Молодой', 'Хорошее', 'Годовой', 1, 4.0, 3),
(7, 'Молодой', 'Плохое', 'Годовой', 1, 3.0, 2),
(7, 'Взрослый', 'Хорошее', 'Годовой', 1, 6.0, 3),
(7, 'Взрослый', 'Плохое', 'Годовой', 1, 5.0, 2),

-- Пингвин (живой корм)
(8, 'Молодой', 'Хорошее', 'Годовой', 2, 4.0, 3),
(8, 'Молодой', 'Плохое', 'Годовой', 2, 3.0, 2),
(8, 'Взрослый', 'Хорошее', 'Годовой', 2, 6.0, 3),
(8, 'Взрослый', 'Плохое', 'Годовой', 2, 5.0, 2);


INSERT INTO daily_feeding_menu (animal_id, diet_id, feeding_number, feeding_date_time, feed_item_id, quantity) VALUES
  -- Тигр
  (1, 13, 1, '2025-04-23 08:00:00', 7, 3.00),
  (1, 13, 2, '2025-04-23 12:00:00', 7, 3.00),
  (1, 13, 3, '2025-04-23 18:00:00', 7, 3.00),
  (2, 13, 1, '2025-04-23 08:00:00', 7, 3.00),
  (2, 13, 2, '2025-04-23 12:00:00', 7, 3.00),
  (2, 13, 3, '2025-04-23 18:00:00', 7, 3.00),
  (3, 5, 1, '2025-04-23 08:00:00', 7, 1.75),
  (3, 5, 2, '2025-04-23 12:00:00', 7, 1.75),
  (3, 5, 3, '2025-04-23 18:00:00', 7, 1.5),

  -- Зебра
  (4, 29, 1, '2025-04-23 08:00:00', 1, 1.67),
  (4, 29, 2, '2025-04-23 12:00:00', 1, 1.67),
  (4, 29, 3, '2025-04-23 18:00:00', 1, 1.67),
  (5, 29, 1, '2025-04-23 08:00:00', 1, 1.67),
  (5, 29, 2, '2025-04-23 12:00:00', 1, 1.67),
  (5, 29, 3, '2025-04-23 18:00:00', 1, 1.67),
  (6, 29, 1, '2025-04-23 08:00:00', 1, 1.67),
  (6, 29, 2, '2025-04-23 12:00:00', 1, 1.67),
  (6, 29, 3, '2025-04-23 18:00:00', 1, 1.67),
  (22, 21, 1, '2025-04-23 08:00:00', 1, 1.00),
  (22, 21, 2, '2025-04-23 12:00:00', 1, 1.00),
  (22, 21, 3, '2025-04-23 18:00:00', 1, 1.00),

  -- Мартышка
  (7, 35, 1, '2025-04-23 08:00:00', 2, 1.33),
  (7, 35, 2, '2025-04-23 12:00:00', 2, 1.33),
  (7, 35, 3, '2025-04-23 18:00:00', 2, 1.33),
  (8, 35, 1, '2025-04-23 08:00:00', 2, 1.33),
  (8, 35, 2, '2025-04-23 12:00:00', 2, 1.33),
  (8, 35, 3, '2025-04-23 18:00:00', 2, 1.33),
  (9, 33, 1, '2025-04-23 08:00:00', 2, 1.00),
  (9, 33, 2, '2025-04-23 12:00:00', 2, 1.00),
  (9, 33, 3, '2025-04-23 18:00:00', 2, 1.00),

  -- Волк
  (10, 49, 1, '2025-04-23 08:00:00', 7, 2.33),
  (10, 49, 2, '2025-04-23 12:00:00', 7, 2.33),
  (10, 49, 3, '2025-04-23 18:00:00', 7, 2.33),
  (11, 49, 1, '2025-04-23 08:00:00', 7, 2.33),
  (11, 49, 2, '2025-04-23 12:00:00', 7, 2.33),
  (11, 49, 3, '2025-04-23 18:00:00', 7, 2.33),
  (12, 49, 1, '2025-04-23 08:00:00', 7, 2.33),
  (12, 49, 2, '2025-04-23 12:00:00', 7, 2.33),
  (12, 49, 3, '2025-04-23 18:00:00', 7, 2.33),

  -- Лев
  (13, 55, 1, '2025-04-23 08:00:00', 7, 3.00),
  (13, 55, 2, '2025-04-23 12:00:00', 7, 3.00),
  (13, 55, 3, '2025-04-23 18:00:00', 7, 3.00),
  (14, 55, 1, '2025-04-23 08:00:00', 7, 3.00),
  (14, 55, 2, '2025-04-23 12:00:00', 7, 3.00),
  (14, 55, 3, '2025-04-23 18:00:00', 7, 3.00),
  (15, 55, 1, '2025-04-23 08:00:00', 7, 3.00),
  (15, 55, 2, '2025-04-23 12:00:00', 7, 3.00),
  (15, 55, 3, '2025-04-23 18:00:00', 7, 3.00),

  -- Панда
  (16, 69, 1, '2025-04-23 08:00:00', 1, 2.33),
  (16, 69, 2, '2025-04-23 12:00:00', 1, 2.33),
  (16, 69, 3, '2025-04-23 18:00:00', 1, 2.33),
  (17, 69, 1, '2025-04-23 08:00:00', 1, 2.33),
  (17, 69, 2, '2025-04-23 12:00:00', 1, 2.33),
  (17, 69, 3, '2025-04-23 18:00:00', 1, 2.33),
  (18, 61, 1, '2025-04-23 08:00:00', 1, 1.33),
  (18, 61, 2, '2025-04-23 12:00:00', 1, 1.33),
  (18, 61, 3, '2025-04-23 18:00:00', 1, 1.33),

  -- Кенгуру
  (19, 75, 1, '2025-04-23 08:00:00', 1, 2.00),
  (19, 75, 2, '2025-04-23 12:00:00', 1, 2.00),
  (19, 75, 3, '2025-04-23 18:00:00', 1, 2.00),
  (20, 75, 1, '2025-04-23 08:00:00', 1, 2.00),
  (20, 75, 2, '2025-04-23 12:00:00', 1, 2.00),
  (20, 75, 3, '2025-04-23 18:00:00', 1, 2.00),
  (21, 73, 1, '2025-04-23 08:00:00', 1, 1.33),
  (21, 73, 2, '2025-04-23 12:00:00', 1, 1.33),
  (21, 73, 3, '2025-04-23 18:00:00', 1, 1.33),

  -- Пингвин
  (23, 79, 1, '2025-04-23 08:00:00', 6, 2.00),
  (23, 79, 2, '2025-04-23 12:00:00', 6, 2.00),
  (23, 79, 3, '2025-04-23 18:00:00', 6, 2.00),
  (24, 79, 1, '2025-04-23 08:00:00', 6, 2.00),
  (24, 79, 2, '2025-04-23 12:00:00', 6, 2.00),
  (24, 79, 3, '2025-04-23 18:00:00', 6, 2.00);


INSERT INTO feed_orders (feed_supplier_id, feed_item_id, ordered_quantity, order_date, delivery_date, price, status) VALUES
  (1, 6, 50.00, '2024-02-20', '2024-02-25', 1500.00, 'Доставлен'),
  (2, 5, 40.00, '2024-02-22', '2024-02-28', 900.00, 'В пути'),
  (1, 1, 200.00, '2024-03-01', '2024-03-05', 5000.00, 'Доставлен'),
  (2, 4, 100.00, '2024-03-05', NULL, 2500.00, 'В пути'),
  (1, 2, 25.00, '2024-04-02', '2024-04-07', 500.00, 'Доставлен');

INSERT INTO zoo_exchanges (animal_id, exchange_date, exchange_type, partner_zoo) VALUES
  (20, '2023-09-01', 'Исходящий', 'Зоопарк Северный'),
  (21, '2023-09-05', 'Исходящий', 'Зоопарк Южный'),
  (22, '2023-09-05', 'Исходящий', 'Зоопарк Южный'),
  (15, '2023-09-05', 'Входящий', 'Зоопарк Южный');
